/*
=====
第1题：1:苹果和虫子
=====

总时间限制:
    1000ms
内存限制:
    65536kB

描述

    你买了一箱n个苹果，很不幸的是买完时箱子里混进了一条虫子。虫子每x小时能吃掉一个苹果，假设虫子在吃完一个苹果之前不会吃另一个，那么经过y小时你还有多少个完整的苹果？
输入
    输入仅一行，包括n，x和y（均为整数）。
输出
    输出也仅一行，剩下的苹果个数
样例输入

    10 4 9

样例输出

    7

提示
    注意：是要求完整的苹果数。
*/

#include<iostream>
using namespace std;

int main() {
    // a: 整除的结果，b: 余数, c: 剩余
    int n = 0, x = 0, y = 0, a = 0, b = 0, c = 0;
    cin >> n >> x >> y;

    a = y / x;
    b = y % x;
    if (b != 0) {
        a++;
    }
    c = n - a;
    if (c < 0) {
        c = 0;
    }
    cout << c;

    return 0;
}
